scripts/org/my-theme.org
#+TITLE: My Theme
#+AUTHOR: Shirishkumar Togarla
#+PROPERTY: header-args :tangle (f-expand (concat (f-base (buffer-file-name)) ".el") "../src")
* Package Initialization
#+begin_src elisp
;;; my-theme.el --- Configuration to be loaded while starting emacs
;;; Commentary

;; The `my-theme' package is used to load the required configuration
#+end_src

* Window Preferences
#+begin_src elisp
;; Window Preferences
;; Left Margin
;(setq-default left-margin-width 2)

;; Menu bar disable
(menu-bar-mode -1)

;; Scroll bar disable
(scroll-bar-mode -1)

;; Tool bar disable
(tool-bar-mode -1)

;; Font size
(set-face-attribute 'default nil :height 120)
#+end_src
* Spacemacs theme
#+begin_src elisp :tangle no
;; Spacemacs theme
 ;; (use-package spacemacs-theme
 ;;   :delight 
 ;;   :ensure t
 ;;   :defer t
 ;;   :init (load-theme 'spacemacs-dark t))
#+end_src
* Monokai theme
#+begin_src elisp :tangle no
;; Monokai theme
;; (use-package monokai-theme
;;   :init
;;   :ensure t
;;   :config
;;   )
#+end_src
* Dracula theme
#+begin_src elisp  :tangle no
;; Dracula theme
;; (use-package dracula-theme
;;  :init
;;  (load-theme 'dracula t)
;;  :ensure t
;;  :config
;;  )
#+end_src
* Hlinum
#+begin_src elisp :tangle no
;; (use-package hlinum
;;   :init
;;   :ensure t
;;   :config
;;   (hlinum-activate)
;;   (hlinum-highlight-line)
;;   )
#+end_src
* zenburn-theme
#+begin_src elisp :tangle no
;; (use-package zenburn-theme
;;   :init
;;   :ensure t
;;   :config
;;   )
#+end_src
* solarized-theme
#+begin_src elisp :tangle no
;; (use-package solarized-theme
;;   :init
;;   :ensure t
;;   :config
;;   (load-theme 'solarized-dark t)
;;   )

#+end_src
* doom-themes
#+begin_src elisp
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-molokai t)

  ;; Enable flashing mode-line on errors
  ;;(doom-themes-visual-bell-config)
  
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;(doom-themes-neotree-config)
  ;; or for treemacs users
  ;(setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
 (doom-themes-org-config))
#+end_src
* doom-modeline
#+begin_src elisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
#+end_src
* Kaolin Treemacs Themes
#+begin_src elisp :tangle no
;; Kaolin Treemacs Themes
;; (use-package kaolin-themes
;;   :init
;;   :ensure t
;;   :config
;;     (kaolin-treemacs-theme)
;;   )
#+end_src
* Package End
#+begin_src elisp
(provide 'my-theme)

;;; my-theme package ends here
#+end_src
